package com.neusoft;

public class ChushiJava {
	/*
/chapter01_初识Java
一、认识JAVA
java是一门纯面向对象的编程语言。
特点：跨平台
技术平台：
a.javaSE:Java底层技术平台，提供了庞大的基础类库。有利于开发桌面应用程序
b.javaEE：企业级的技术平台。有利于开发基于Internet应用程序（WEB）

二.Java的编写以及运行的过程
a.编写源码---文件为：xxx.java
  注意:文件名一定要与类名一致。
b.编译源文件。使用javac命令
  计算机只认识二进制语言，编译的过程就是将源码编译成二进制文件。xxx.class.
c.运行编译后的二进制文件。java命令

三、注释：
1.单行注释:
 作用：a.如果出现在代码的前端，使当前代码不被执行。
       b.出现在代码的上方，意味着在简述当前代码的作用。
       c.出现在变量的后面。意味着描述当前变量定义的含义。
       d.对于初学者能更好的快速的建立编程思维逻辑，能够将
         计算机程序与现实生活中的事情的执行过程有更好的转换，
         所以建议先将问题的解决步骤使用单行注释一并写完，然后
         再进行统一编码。
2.多行注释:
  作用:a.出现在类的上面，是在描述当前类的作用。
       b.出现在方法的上面，是在描述当前这个方法的作用.
       c.如果有一定范围的代码暂时不被执行，那么可以使用该
         注释进行屏蔽。
*/
}
