package com.neusoft;

public class LearnMethod {
/*
 
 1、我们创建一个类  new class 创建好一个类
 2、在类中我们可以书写的内容有  变量  方法
 3、 方法是用来干什么的  为什么需要使用方法
         带有操作性质的  逻辑功能代码    堆叠在一起  写在方法体当中  形成一定的完整的功能 就称之为方法
 4、如何去定义一个方法 
   权限修饰符    
   方法的返回值类型  
  方法名<对方法进行命名的时候要注意 方法名称最好为动词  
   如若含有两个或两个以上单词 第一个单词全部小写后面的单词首字母大写>
 (方法的入参) 方法入参 是别人直接调用该方法的时候 传递给方法参数  由方法本身的内部业务逻辑进行处理 处理完毕后  将结果值进行返回
 {
  写业务逻辑代码
 }  
 5、如何去调用一个类中的一个方法：
    对象引用.方法名  的形式 进行调用方法
 6、方法与方法之间的互相调用
 7、在同一个类当中  普通方法彼此之间的互相调用    直接在方法中直接写直接用 无需通过引用.的形式  
         无论方法写的顺序如何  不会影响彼此之间的调用
 8、当一个方法 无需返回结果的时候 要使用void 在方法返回值位置占位
 9、创建一个Human 类 在该类中 想一想 人都会哪些动作  用方法的形式展示出来
    
 */
		
//		//左边类名称    等号 右边  创建对象的过程   
//		//obj是对象的引用   对象的引用跟对象之间的关系 相当于 遥控器跟电视机的关系
		
	}
	